

#відповідь Джарвіса
ration_jarvis =(    
    'Звісно, сер!',
    'Так, сер!',
    'Слухaюсь, сер',
    'Роблю це, сер!',
    'Вже виконую, сер!',
    'Негайно, сер!',
    'Задоволення працювати для вас!',
    'Уже працюю над цим!',
    'Ваше бажання — закон, сер!',
    'Миттєво, сер!',
    'Зараз усе буде!',
    'Я народжений для цього, сер!',
    'Джарвіс до ваших послуг!',)

# команди джарвіса
dict_respound ={
    "слава україні":"Героям слава",
    "як справи":"Сер, справи у мене чудові",
    "мені сумно":"Сер якщо вам сумно, тоді йдіть програмуйте",
    "привіт":"Й вам привіт, сер ",
    "доброго дня":"Добрий, сер",
    "добрий вечір":"Доброго й вам",
    "котра година":"час",
    "яка зараз година":"час",
    "година":"час",
    "час":"час",


    "відкрий spotify": "replic",
    "відкрий steam" : "replic",
    "відкрий telegram": "replic",
    "відкрий телеграм": "replic",
    "відкрий visual vtudio" or "відкрий vs" or "відкрий код" : "replic",


    "закрий spotify": "replic",
    "закрий steam" : "replic",
    "закрий telegram" or "закрий телеграм" : "replic",
    "закрий visual vtudio" or "закрий vs" or "закрий код" : "replic",


    "виключи комп’ютер": "replic",
    "виключи пк": "replic",

    "відкрий блокнот": "replic",
    "відкрий браузер": "replic",

    "телефона книга":"replic",
    "телефона книжка":"replic", 
    
    "список задач": "replic",
    "відкрий список задач": "replic",
    "задачі": "replic",
    
    "погода":"replic",
    "яка погода":"replic",

    "запис":"replic",


}


jarvis_pc = [
    "відкрий spotify", "відкрий steam" ,  "відкрий telegram" , "відкрий телеграм" , 
    "відкрий visual vtudio" , "відкрий vs" , "відкрий код" , "виключи комп’ютер", 
    "виключи пк", "відкрий блокнот", "відкрий браузер",
    "закрий spotify", "закрий steam" ,  "закрий telegram" , "закрий телеграм" , 
    "закрий visual vtudio" , "закрий vs" , "закрий код" ,
    ]

jarvis_error = [
    "Сер, я не зміг розпізнати вашу команду.",
    "Будь ласка, повторіть — я не зрозумів вас, сер.",
    "Ця команда мені невідома.",
    "Схоже, у нас стався збій у зв’язку, сер.",
    "Вибачте, я не здатен виконати це завдання.",
    "Це звучить складно навіть для мене, сер.",
    "На жаль, я не запрограмований на таке, сер.",
    "Сер, ця команда не входить до мого функціоналу.",
    "Можливо, помилка в диктуванні?",
    "Команда не опрацьована. Пропоную перевірити формулювання.",
    "Вибачте, сер, але я не знайшов дій, що відповідають цій команді.",
    "Можливо, ви хотіли сказати щось інше?",
    "Я все ще вчуся, сер. Цього я поки не знаю.",
    "Команда не зареєстрована в системі.",
    "Сер, ваша команда звучить як магія, але я не чарівник.",
    "На жаль, ця команда пройшла повз мої протоколи.",
    "Це не входить до моїх обов’язків… поки що.",
    "Може, краще ще раз? Я не впевнений, що почув правильно.",
    "Я не зміг знайти інструкцій для цієї дії, сер.",
    "Звучить цікаво, але я не знаю, як це зробити."
]

# пошук потрібного файла

